|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("titanic_dataset.csv")
df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [3]:
df[df.isna()]

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1305,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1306,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1307,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1308,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df.shape

(1309, 15)

In [5]:
df.shape
a=df.columns[df.isnull().mean() > 0.25]
df.drop(list(a),axis=1,inplace=True)
df.shape

(1309, 11)

In [6]:
df.drop(columns=['name','fare','embarked']).head(5)

   Unnamed: 0  pclass  survived  gender      age  sibsp  parch  ticket
0           0       1         1  female  29.0000      0      0   24160
1           1       1         1    male   0.9167      1      2  113781
2           2       1         0  female   2.0000      1      2  113781
3           3       1         0    male  30.0000      1      2  113781
4           4       1         0  female  25.0000      1      2  113781

In [26]:
df.dtypes

Unnamed: 0      int64
pclass          int64
survived        int64
name           object
gender         object
age           float64
sibsp           int64
parch           int64
ticket         object
fare          float64
embarked       object
dtype: object

In [27]:
df.fare.fillna(0) #convert price

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [21]:
#find columns still having missing/na values and also count of missing data
print(df.isna())
df.isna().sum()

      Unnamed: 0  pclass  survived   name  gender    age  sibsp  parch  \
0          False   False     False  False   False  False  False  False
1          False   False     False  False   False  False  False  False
2          False   False     False  False   False  False  False  False
3          False   False     False  False   False  False  False  False
4          False   False     False  False   False  False  False  False
...          ...     ...       ...    ...     ...    ...    ...    ...
1304       False   False     False  False   False  False  False  False
1305       False   False     False  False   False  False  False  False
1306       False   False     False  False   False  False  False  False
1307       False   False     False  False   False  False  False  False
1308       False   False     False  False   False  False  False  False

      ticket   fare  embarked
0      False  False     False
1      False  False     False
2      False  False     False
3      False  False     False
4      False  False     False
...      ...    ...       ...
1304   False  False     False
1305   False  False     False
1306   False  False     False
1307   False  False     False
1308   False  False     False

[1309 rows x 11 columns]

Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
fare          0
embarked      2
dtype: int64

In [29]:
#fill na with mean for fare and age column column.
df.fare.fillna(df.fare.mean(),inplace=True)
df.age.fillna(df.age.mean(),inplace=True)
df.isna().sum()

Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
fare          0
embarked      2
dtype: int64

In [30]:
#drop na values for embarked column.
print(df.shape)
print(df.embarked.isna().sum())
#print(df.index.where(df.embarked.isna()==True))
df.embarked.dropna(axis=0,inplace=True)
print(df.shape)

(1309, 11)
2
(1309, 11)

In [31]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
#dir(df)
df.to_csv("Titanic_filtered.csv",index=False,header=True)

In [32]:
#for surviced column replace 0 with D and 1 with A
df.survived.replace({0:"D",1:"A"},inplace=True)
print(df.head(5))

   Unnamed: 0  pclass survived  \
0           0       1        A
1           1       1        A
2           2       1        D
3           3       1        D
4           4       1        D

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket    fare embarked
0      0   24160  211.34        S
1      2  113781  151.55        S
2      2  113781  151.55        S
3      2  113781  151.55        S
4      2  113781  151.55        S

In [33]:
#find the frequency of different values in survived column

df.survived.value_counts()

D    809
A    500
Name: survived, dtype: int64

In [34]:
#group by gender and survived and see the counts in each category

df1= df.groupby(['gender','survived'])
#print(df.groupby(['gender','survived'])['gender'].value_counts())
print(df.groupby(['gender','survived'])['gender'].count())

#print(df.groupby(['gender','survived'])['survived'].value_counts())
print(df.groupby(['gender','survived'])['survived'].count())

gender  survived
female  A           339
        D           127
male    A           161
        D           682
Name: gender, dtype: int64
gender  survived
female  A           339
        D           127
male    A           161
        D           682
Name: survived, dtype: int64

In [35]:

#find different pclass and no of people in each class

print(df.groupby(['pclass'])['pclass'].count())

pclass
1    323
2    277
3    709
Name: pclass, dtype: int64

In [36]:
print(df.sort_values(by=['age'],ascending=False).nlargest(5,['age']))
print(df.sort_values(by=['age'],ascending=False).nlargest(5,['age']).groupby(['gender']).age.count())

      Unnamed: 0  pclass survived  \
14            14       1        A
61            61       1        A
1235        1235       3        D
135          135       1        D
9              9       1        D

                                                   name  gender   age  sibsp  \
14                 Barkworth, Mr. Algernon Henry Wilson    male  80.0      0
61    Cavendish, Mrs. Tyrell William (Julia Florence...  female  76.0      1
1235                                Svensson, Mr. Johan    male  74.0      0
135                           Goldschmidt, Mr. George B    male  71.0      0
9                               Artagaveytia, Mr. Ramon    male  71.0      0

      parch    ticket   fare embarked
14        0     27042  30.00        S
61        0     19877  78.85        S
1235      0    347060   7.78        S
135       0  PC 17754  34.65        C
9         0  PC 17609  49.50        C
gender
female    1
male      4
Name: age, dtype: int64

In [37]:
#find max age male and female who survived

filter1=df.survived=='A' 
filter2= ~(df.survived.isna())
df.where(filter2 | filter1 ).groupby(['gender']).age.max()

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [38]:
#get average age by gender
df.groupby(['gender']).age.mean()

gender
female    28.886935
male      30.430716
Name: age, dtype: float64

In [39]:
#get average age by people survived vs not-survived
filter1= ~(df.survived.isna())

df.where(filter1).groupby(['survived']).age.mean()

survived
A    29.058812
D    30.389368
Name: age, dtype: float64